#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PHO-RSC-GROUPS/hsiar_dart"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "82b03c5f-8498-4762-b24c-7ab0a792debf"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PHO-RSC-GROUPS/hsiar_phar"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "82b03c5f-8498-4762-b24c-7ab0a792debf"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PHO-RSC-GROUPS/hsiar_ppd"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "82b03c5f-8498-4762-b24c-7ab0a792debf"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PHO-RSC-GROUPS/hsiar_wfa"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "82b03c5f-8498-4762-b24c-7ab0a792debf"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PHO-RSC-GROUPS/opho"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "82b03c5f-8498-4762-b24c-7ab0a792debf"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC-GROUPS.module.client-roles.keycloak_role.ROLES["hsiar_dart"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "hsiar_dart"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC-GROUPS.module.client-roles.keycloak_role.ROLES["hsiar_phar"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "hsiar_phar"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC-GROUPS.module.client-roles.keycloak_role.ROLES["hsiar_ppd"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "hsiar_ppd"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC-GROUPS.module.client-roles.keycloak_role.ROLES["hsiar_wfa"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "hsiar_wfa"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC-GROUPS.module.client-roles.keycloak_role.ROLES["opho"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "opho"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-pho-rsc-groups"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "2ddc7173-34f3-41ff-9beb-66c7802717ce"
      + id        = (known after apply)
      + name      = "view-client-pho-rsc-groups"
      + realm_id  = "moh_applications"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @sharpedavid, Action: `pull_request`*